laazizi/robotandme/controllers/mowbot_p4/sdkconfig.defaults
# mowbot_p4 : cible et options propres a l'ESP32-P4.
# CONFIG_IDF_TARGET est LA source de verite de la cible : scripts/build.sh le
# lit ici pour set-target et pour savoir quelle libmicroros reconstruire.
# Les options communes (FreeRTOS) sont dans ../common/sdkconfig.defaults, le
# transport dans ../common/sdkconfig.serial ou .eth.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_HOSTED_ENABLED=n
